In [ ]:
# Installing a package
# pip install <package_name>

In [1]:
# Importing packages
# import <package_name> as <variable_name> or import <package_name>
import pandas as pd

In [2]:
# Pandas Data Structure
# Series - pandas one dimensional array with labels. 
# Each element has a label called 'index'
my_series = pd.Series(['a','b','12', '12'])
print(my_series)
print(type(my_series))

0     a
1     b
2    12
3    12
dtype: object
<class 'pandas.core.series.Series'>

In [3]:
data = pd.Series([1,2,3,4,5,6,7,8,9], index=['a','b','c','d','e','f','g','h','i'])
data

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

In [ ]:
data = pd.Series([82,9,"asd",5,8,6,7,8,9], index=['a','b','c','d','e','f','g','h','i'])
data.head(2)

In [ ]:
data = pd.Series([82,9,"asd",5,8,6,7,8,9], index=['a','b','c','d','e','f','g','h','i'])
data.tail(3)

In [ ]:
# Convert dictionary to series
data_dict = {'a':1, 'b':2, 'c':3,'d':4}
data1 = pd.Series(data_dict)

In [ ]:
data1

In [ ]:
data2 = pd.Series([4,5,6.2,7.8])
data2

In [ ]:
# Typecasting
data2.astype(int)

In [ ]:
12%2

In [ ]:
data3 = pd.Series([10,12,14,'Even','Odd','Even','Odd','Even',12], name='nos')
data3

In [ ]:
# .values method returns an array with all the values of the series
data3.values

In [ ]:
# Series - meta data
print('Name of the Series:',data3.name)
print('Shape of the Series:',data3.shape)
print('Length of the Series:',len(data3))
print('The Datatype of series is:',data3.dtype)

In [ ]:
# count values or frequencies
data3.value_counts()

In [ ]:
# Dataframe - pandas 
# powerful data type
# represents tabular data with rows and columns
# powerful inbuilt functions to make complex data transformations easy
# read or write from multiple formats like CSV, TXT, TSV, JSON, HDF5
# database operations are very easy and can be connected to most of the standard databases

In [1]:
birth_month = { 'name': ['Bala', 'Ravi', 'Rahul'],
               'month': ['Aug', 'Dec', 'Sep']
}

In [ ]:
pd.DataFrame(birth_month)

In [5]:
# Dictionary to dataframe
employee_data = {'name': ['Bala','Rahul','Rajesh','Sanjay','Souwmya','Ritesh','Ganesh'],
                'age': [33,28,45,40,35,24,45],
                'city': ['Madurai','Coimbatore','Chennai','Bangalore','Hyderabad', 'Mumbai','Mumbai']}
employee = pd.DataFrame(employee_data)
employee.iloc[:,0:3]
#employee

      name  age        city
0     Bala   33     Madurai
1    Rahul   28  Coimbatore
2   Rajesh   45     Chennai
3   Sanjay   40   Bangalore
4  Souwmya   35   Hyderabad
5   Ritesh   24      Mumbai
6   Ganesh   45      Mumbai

In [ ]:
#import numpy as np

In [ ]:
# DataFrame properties
print(employee.shape)

In [ ]:
employee.info()

In [ ]:
# row labels of a dataframe
employee.index

In [ ]:
# columns labels of a dataframe
employee.columns

In [ ]:
# Datatypes
employee.dtypes

In [ ]:
# Get Unique Categories
employee['city'].unique()

In [ ]:
# Get number of unique categories
employee['city'].nunique()

In [ ]:
employee

In [ ]:
# Label Based Indexing
employee['city'] # Access elements similar to dictionary

In [ ]:
employee['age']

In [ ]:
employee['name']

In [ ]:
# Extract data from 3rd row with index 2
employee.loc[2] # Location based indexing

In [ ]:
employee.loc[1]

In [6]:
# Location based index 
# Format [row index, column index]
employee.iloc[0:]

      name  age        city
0     Bala   33     Madurai
1    Rahul   28  Coimbatore
2   Rajesh   45     Chennai
3   Sanjay   40   Bangalore
4  Souwmya   35   Hyderabad
5   Ritesh   24      Mumbai
6   Ganesh   45      Mumbai

In [7]:
# Format [row index, column index]
# subset a series - extract 3rd and 4th row and all  columns
employee.iloc[2:4, :]

     name  age       city
2  Rajesh   45    Chennai
3  Sanjay   40  Bangalore

In [8]:
# Subset a series - extract rows 3 and 4, columns 1 and 2
employee.iloc[2:4, 0:2]

     name  age
2  Rajesh   45
3  Sanjay   40

In [ ]:
# Subset a series - extract columns 1 and 2
employee[['name', 'age']]

In [ ]:
employee[['name', 'age']]

In [ ]:
# Filter based on values
employee[employee['age'] >= 35]

In [ ]:
employee[employee['city'] == 'Mumbai']

In [ ]:
# Perform mathematical operations
employee['age']-5

In [ ]:
employee

In [ ]:
employee

In [10]:
# creating dummy variable - One Hot encoding
dummies = pd.get_dummies(employee['city'])

In [10]:
# Filtering columns
employee.filter(items=['city'])

         city
0     Madurai
1  Coimbatore
2     Chennai
3   Bangalore
4   Hyderabad
5      Mumbai
6      Mumbai

In [16]:
# Filtering rows
employee.filter(like='2', axis=0)

     name  age     city
2  Rajesh   45  Chennai

In [12]:
# Set name as Index, useful to indicate the Index as output for the model 
employee = employee.set_index('name')
employee

         age        city
name
Bala      33     Madurai
Rahul     28  Coimbatore
Rajesh    45     Chennai
Sanjay    40   Bangalore
Souwmya   35   Hyderabad
Ritesh    24      Mumbai
Ganesh    45      Mumbai

In [13]:
employee.set_index('city')

            age
city
Madurai      33
Coimbatore   28
Chennai      45
Bangalore    40
Hyderabad    35
Mumbai       24
Mumbai       45

In [14]:
# Reset index
employee = employee.reset_index()

In [15]:
employee

      name  age        city
0     Bala   33     Madurai
1    Rahul   28  Coimbatore
2   Rajesh   45     Chennai
3   Sanjay   40   Bangalore
4  Souwmya   35   Hyderabad
5   Ritesh   24      Mumbai
6   Ganesh   45      Mumbai